export const LANGUAGE_TAGS = ['Испанский', 'Русский', 'Английский'];
export const INTEREST_TAGS = [
  'Путешествия', 'Музыка', 'Кулинария', 'Спорт/Фитнес', 'Чтение книг',
  'Кино/Сериалы', 'Фотография', 'Искусство', 'Танцы', 'Волонтерство',
  'Природа/Походы', 'Видеоигры', 'Животные/Домашние питомцы', 'Вино/Дегустации', 'Здоровый образ жизни',
  'Йога/Медитация', 'Саморазвитие/Психология', 'Мода/Стиль', 'Технологии/Гаджеты', 'Автомобили/Мотоциклы'
];

export const GENDERS_TAGS = ['Мужской', 'Женский', 'N/A'];

export const PETTYPES_TAGS = ['Собака', 'Код'];

export const BREEDS_TAGS = [
  "Шарпей", "Лабрадор", "Лайка", "Хаски", "Лабрадор ретривер", "Немецкая овчарка",
  "Голден ретривер", "Французский бульдог", "Бульдог", "Пудель", "Бигль", "Ротвейлер",
  "Йоркширский терьер", "Немецкий дог", "Сибирский хаски", "Мальтийская болонка", "Боксер", "Чихуахуа",
  "Доберман", "Бордер-колли", "Ши-тцу", "Кокер-спаниель", "Английский бульдог",
  "Бостон-терьер", "Папийон", "Пекинес", "Самоед", "Вест-хайленд-уайт-терьер", "Вельш-корги пемброк",
  "Акита", "Австралийская овчарка", "Бассет-хаунд", "Далматин", "Колли", "Ирландский сеттер",
  "Итальянский грейхаунд", "Лхаса апсо", "Мопс", "Ньюфаундленд", "Аляскинский маламут", "Американский бульдог",
  "Бельгийская овчарка (малинуа)", "Американский стаффордширский терьер", "Басенджи", "Лабрадудль", "Кане корсо", "Кавалер-кинг-чарльз-спаниель",
  "Пойнтер", "Русский той", "Фокстерьер", "Грейхаунд", "Шелти (Шетландская овчарка)", "Веймаранер"
];

export const petUriImage = 'https://firebasestorage.googleapis.com/v0/b/petmeetar.appspot.com/o/assets%2Fimages%2Fpet%2Fthumbnail.png?alt=media&token=f6fd6149-8755-4a80-a903-635de3c570eb';