export const LANGUAGE_TAGS = ['Испанский', 'Русский', 'Английский'];
export const INTEREST_TAGS = [
  'Путешествия', 'Музыка', 'Кулинария', 'Спорт', 'Книг',
  'Кино', 'Фотография', 'Искусство', 'Танцы', 'Волонтерство',
  'Природа', 'Походы', 'Видеоигры', 'Животные', 'Питомцы', 'Вино', 'Здоровье',
  'Йога', 'Медитация', 'Саморазвитие', 'Психология', 'Мода', 'Технологии', 'Гаджеты', 'Автомобили', 'Мотоциклы'
];

export const GENDERS_TAGS = ['Мужской', 'Женский', 'N/A'];

export const PETTYPES_TAGS = ['Собака', 'Код'];

export const BREEDS_TAGS = [
  "Шарпей", "Лабрадор", "Лайка", "Хаски", "Лабрадор ретривер", "Немецкая овчарка",
  "Голден ретривер", "Французский бульдог", "Бульдог", "Пудель", "Бигль", "Ротвейлер",
  "Йоркширский терьер", "Немецкий дог", "Сибирский хаски", "Мальтийская болонка", "Боксер", "Чихуахуа",
  "Доберман", "Бордер-колли", "Ши-тцу", "Кокер-спаниель", "Английский бульдог",
  "Бостон-терьер", "Папийон", "Пекинес", "Самоед", "Вест-хайленд-уайт-терьер", "Вельш-корги пемброк",
  "Акита", "Австралийская овчарка", "Бассет-хаунд", "Далматин", "Колли", "Ирландский сеттер",
  "Итальянский грейхаунд", "Лхаса апсо", "Мопс", "Ньюфаундленд", "Аляскинский маламут", "Американский бульдог",
  "Бельгийская овчарка (малинуа)", "Американский стаффордширский терьер", "Басенджи", "Лабрадудль", "Кане корсо", "Кавалер-кинг-чарльз-спаниель",
  "Пойнтер", "Русский той", "Фокстерьер", "Грейхаунд", "Шелти (Шетландская овчарка)", "Веймаранер"
];

export const PETINTERESTS_TAGS = [
  'Игры с мячом', 'Прогулки', 'Бег на улице', 'Плавание', 'Гонки',
  'Апортирование', 'Дрессировка', 'Охота', 'Прыжки', 'Аджилити',
  'Ловля фрисби', 'Нюхать следы', 'Следопытство', 'Искать предметы', 'Грызть игрушки',
  'Тянуть поводок', 'Ловить игрушки', 'Прятки', 'Наблюдать', 'Социализация с собаками',
  'Гулять в парке', 'Лежать на солнце', 'Спать', 'Зарываться в подстилку', 'Поиск угощений',
  'Охрана дома', 'Лазание', 'Игрушки', 'Обучение командам', 'Беготня',
  'Мяч', 'Работа с человеком', 'Носить вещи', 'Резвиться', 'Копать землю',
  'Прыгать через барьеры', 'Плавать в воде', 'Искать запахи', 'Тянуть санки', 'Бодрость',
  'Энергия', 'Забег', 'Игры с хозяином', 'Оборона территории', 'Носить рюкзак',
  'Защита', 'Борьба с игрушками', 'Координация движений', 'Слежка за объектами', 'Лидерство в стае'
];

export const PETHEALTHISSUES_TAGS = [
  'Аллергия', 'Анемия', 'Артрит', 'Артроз', 'Астма', 'Болезни кожи', 'Болезни печени', 
  'Глухота', 'Глазные болезни', 'Диабет', 'Дилатационная кардиомиопатия', 'Дисплазия', 'Дыхательные заболевания',
  'Зооагрессия', 'Крипторхизм', 'Мутация MDR1', 'Онкология', 'Особенности психики', 'Печеночная недостаточность',
  'Проблемы с позвоночником', 'Проблемы с сердцем', 'Проблемы с суставами', 'Проблемы с ушами', 'Проблемы с хвостом',
  'Слепота', 'Шумовая фобия', 'Эпилепсия', 'Эндокринные заболевания', 'Энтеропатия', 'Энцефалопатия'
];


export const petUriImage = 'https://firebasestorage.googleapis.com/v0/b/petmeetar.appspot.com/o/assets%2Fimages%2Fpet%2Fthumbnail.png?alt=media&token=f6fd6149-8755-4a80-a903-635de3c570eb';