export const LANGUAGE_TAGS = ['Испанский', 'Русский', 'Английский'];
export const INTEREST_TAGS = [
  'Путешествия', 'Музыка', 'Кулинария', 'Спорт', 'Книги',
  'Кино', 'Фотография', 'Искусство', 'Танцы', 'Волонтерство',
  'Природа', 'Походы', 'Видеоигры', 'Животные', 'Питомцы', 
  'Вино', 'Здоровье', 'Йога', 'Медитация', 'Саморазвитие', 
  'Психология', 'Мода', 'Технологии', 'Гаджеты', 'Автомобили', 
  'Мотоциклы', 'Езда на велосипеде', 'Рыбалка', 'Рисование', 'Театр', 
  'Кроссворды', 'Настольные игры', 'Шахматы', 'Фитнес', 'Рукоделие', 
  'Косметика', 'Садоводство', 'Крафт', 'История', 'Наука', 
  'Политика', 'Блогинг', 'Интернет-маркетинг', 'Фэнтези', 'Астрономия', 
  'Электроника', 'Футбол', 'Киберспорт', 'Бизнес', 'Стартапы'
];
export const GENDERS_TAGS = ['Мужской', 'Женский', 'N/A'];
export const PETGENDERS_TAGS = ['Мальчик', 'Девочка'];
export const PETTYPES_TAGS = ['Собака', 'Код'];
export const BREEDS_TAGS = [
  "Шарпей", "Лабрадор", "Лайка", "Хаски", "Лабрадор ретривер", "Немецкая овчарка",
  "Голден ретривер", "Французский бульдог", "Бульдог", "Пудель", "Бигль", "Ротвейлер",
  "Йоркширский терьер", "Немецкий дог", "Сибирский хаски", "Мальтийская болонка", "Боксер", "Чихуахуа",
  "Доберман", "Бордер-колли", "Ши-тцу", "Кокер-спаниель", "Английский бульдог",
  "Бостон-терьер", "Папийон", "Пекинес", "Самоед", "Вест-хайленд-уайт-терьер", "Вельш-корги пемброк",
  "Акита", "Австралийская овчарка", "Бассет-хаунд", "Далматин", "Колли", "Ирландский сеттер",
  "Итальянский грейхаунд", "Лхаса апсо", "Мопс", "Ньюфаундленд", "Аляскинский маламут", "Американский бульдог",
  "Бельгийская овчарка (малинуа)", "Американский стаффордширский терьер", "Басенджи", "Лабрадудль", "Кане корсо", "Кавалер-кинг-чарльз-спаниель",
  "Пойнтер", "Русский той", "Фокстерьер", "Грейхаунд", "Шелти (Шетландская овчарка)", "Веймаранер"
];

export const DOGGAMES_TAGS = [
  'Аппортировка', 'Перетягивание', 'Прятки', 'Фрисби', 'Аджилити', 
  'Погоня за мячом', 'Собачий парк', 'Полоса препятствий', 'Беговые игры', 
  'Прятать игрушку', 'Обучение трюкам', 'Игры на обоняние', 'Пазлы для собак', 
  'Игры с водой', 'Групповая игра', 'Время для игр', 'Поймать мяч', 
  'Поймай и принеси', 'Перетягивание каната', 'Активные игры'
];

export const DOGVACCINATIONS_TAGS = [
  'От бешенства', 'от чумы плотоядных', 'от парвовируса', 
  'от аденовируса', 'от парагриппа', 
  'от лептоспироза', 'от коронавируса', 'от бордетеллы', 
  'от лаймской болезни', 'от дерматофитий', 'от боррелиоза'
];

export const PETINTERESTS_TAGS = [
  'Игры с мячом', 'Прогулки', 'Бег на улице', 'Плавание', 'Гонки',
  'Апортирование', 'Дрессировка', 'Охота', 'Прыжки', 'Аджилити',
  'Ловля фрисби', 'Нюхать следы', 'Следопытство', 'Искать предметы', 'Грызть игрушки',
  'Тянуть поводок', 'Ловить игрушки', 'Прятки', 'Наблюдать', 'Социализация с собаками',
  'Гулять в парке', 'Лежать на солнце', 'Спать', 'Зарываться в подстилку', 'Поиск угощений',
  'Охрана дома', 'Лазание', 'Игрушки', 'Обучение командам', 'Беготня',
  'Мяч', 'Работа с человеком', 'Носить вещи', 'Резвиться', 'Копать землю',
  'Прыгать через барьеры', 'Плавать в воде', 'Искать запахи', 'Тянуть санки', 'Бодрость',
  'Энергия', 'Забег', 'Игры с хозяином', 'Оборона территории', 'Носить рюкзак',
  'Защита', 'Борьба с игрушками', 'Координация движений', 'Слежка за объектами', 'Лидерство в стае'
];

export const PETHEALTHISSUES_TAGS = [
  'Аллергия', 'Анемия', 'Артрит', 'Артроз', 'Астма', 'Болезни кожи', 'Болезни печени', 
  'Глухота', 'Глазные болезни', 'Диабет', 'Дилатационная кардиомиопатия', 'Дисплазия', 'Дыхательные заболевания',
  'Зооагрессия', 'Крипторхизм', 'Мутация MDR1', 'Онкология', 'Особенности психики', 'Печеночная недостаточность',
  'Проблемы с позвоночником', 'Проблемы с сердцем', 'Проблемы с суставами', 'Проблемы с ушами', 'Проблемы с хвостом',
  'Слепота', 'Шумовая фобия', 'Эпилепсия', 'Эндокринные заболевания', 'Энтеропатия', 'Энцефалопатия'
];

export const PROFESSIONS_TAGS = [
  'Программирование', 'Дизайн', 'Маркетинг', 'Финансы', 'Инженерия',
  'Юриспруденция', 'Медицина', 'Образование', 'Журналистика', 'Аналитика данных',
  'Управление проектами', 'Рекрутинг', 'Логистика', 'Психология', 'Продажи',
  'Строительство', 'Кибербезопасность', 'Экология', 'Искусство', 'Научные исследования',
  'Архитектура', 'Фармацевтика', 'Сельское хозяйство', 'Ветеринария', 'Промышленное производство',
  'Энергетика', 'Туризм', 'Гостиничное дело', 'Ресторанный бизнес', 'Торговля',
  'HR (Управление персоналом)', 'PR (Связи с общественностью)', 'Реклама', 'Копирайтинг', 'Редактура',
  'Перевод', 'Административная работа', 'IT-администрирование', 'Разработка игр', 'UX/UI дизайн',
  'Графический дизайн', 'Веб-дизайн', 'Мультимедиа', 'Видео-монтаж', 'Звукорежиссура',
  'Фотография', 'Социальная работа', 'Косметология', 'Парикмахерское искусство', 'Физиотерапия',
  'Тренерская деятельность', 'Спортивная аналитика', 'Военное дело', 'Политология', 'Государственное управление',
  'Международные отношения', 'Философия', 'История', 'Социология', 'Культурология',
  'Литературоведение', 'Биология', 'Химия', 'Физика', 'Математика',
  'Астрономия', 'Геология', 'География', 'Экономика', 'Менеджмент',
  'Управление качеством', 'Бухгалтерия', 'Аудит', 'Налоговое консультирование', 'Финансовый анализ',
  'Банковское дело', 'Страхование', 'Инвестиции', 'Логопедия', 'Дефектология',
  'Радиотехника', 'Авиация', 'Космическая техника', 'Машиностроение', 'Автомобилестроение',
  'Химическая промышленность', 'Рыболовство', 'Океанология', 'Дизайн интерьеров', 'Ландшафтный дизайн',
  'Ремесла', 'Ювелирное дело', 'Часовое дело', 'Робототехника', 'Нанотехнологии',
  'Генетика', 'Фармакология', 'Информационная безопасность', 'Разработка мобильных приложений', 'Компьютерные сети',
  'Системное администрирование', 'Генеральный менеджмент', 'Логистика и снабжение', 'Закупки', 'Транспортировка',
  'Внешнеэкономическая деятельность', 'Инженерные сети', 'Телекоммуникации', 'Производство программного обеспечения', 'Управление ИТ-инфраструктурой',
  'Контент-менеджмент', 'SEO-оптимизация', 'SMM (Социальные медиа)', 'Email-маркетинг', 'Контекстная реклама',
  'Мобильный маркетинг', 'Облачные вычисления', 'Машинное обучение', 'Искусственный интеллект', 'Криптография',
  'Анализ систем', 'Автоматизация процессов', 'Интернет вещей (IoT)', '3D-моделирование', 'Дополненная реальность (AR)',
  'Виртуальная реальность (VR)', 'Обработка изображений', 'Сценаристика', 'Анимация', 'Режиссура',
  'Продюсирование', 'Телевизионное производство', 'Радио', 'Актёрское мастерство', 'Медицина (врач)',
  'Стоматология', 'Педиатрия', 'Психиатрия', 'Неврология', 'Кардиология',
  'Терапия', 'Хирургия', 'Офтальмология', 'Фармация', 'Акушерство',
  'Реабилитация', 'Психотерапия', 'Эндокринология', 'Иммунология', 'Аллергология',
  'Гастроэнтерология', 'Урология', 'Акустика', 'Палеонтология', 'Зоология',
  'Орнитология', 'Ботаника', 'Антропология', 'Археология', 'Этнография',
  'Музееведение', 'Антиквариат', 'Электротехника', 'Микроэлектроника', 'Полупроводниковые технологии',
  'Материаловедение', 'Технология производства', 'Стандартизация', 'Контроль качества', 'Металлургия',
  'Деревообработка', 'Целлюлозно-бумажная промышленность', 'Текстильная промышленность', 'Кожевенная промышленность', 'Промышленный дизайн',
  'Пищевые технологии', 'Технологии переработки отходов', 'Экологический менеджмент', 'Возобновляемые источники энергии', 'Нефтегазовая промышленность',
  'Тяжёлое машиностроение', 'Скотоводство', 'Аквакультура', 'Экономика природопользования', 'Управление водными ресурсами',
  'Инновационный менеджмент', 'Бренд-менеджмент', 'Продакт-менеджмент', 'Фандрайзинг', 'Коучинг',
  'Консалтинг', 'Тайм-менеджмент'
];

export const DANGERTYPE_TAGS = [
  "Другое",
  "Трафик",
  "Агрессивные собаки",
  "Отравленные приманки",
  "Плохое освещение",
  "Преступность",
  "Дикие животные",
  "Открытые зоны без ограждений",
  "Битое стекло",
  "Бездомные собаки",
  "Строительные площадки",
  "Места с сильными шумами",
  "Переполненные людьми зоны",
  "Загрязненные территории",
  "Опасные растения",
  "Разбитые тротуары",
  "Змеи",
  "Клещи",
  "Мусор"
];

export const USERSPOINTTYPE_TAGS =[
  'Парк',
  'Зона для собак',
  'Игровая площадка',
  'Кафе',
  'Ресторан',
  'Магазин для животных',
  'Ветеринарная клиника',
  'Другое'
];

export const AMENITIES_TAGS: string[] = [
  "Зона без поводка", "Полностью огорожено", "Тропа для собак", "Открытое поле", "Зона для плавания",
  "Только на поводке", "Зона для кемпинга", "Дикая природа", "Разделение для больших и маленьких собак", "Препятствия",
  "Двойной вход с воротами", "Фонтанчик для воды", "Бесплатный вход", "Только для членов", "Бесплатная парковка рядом",
  "Доступность для инвалидных колясок", "Зона для сидения", "Тенистая зона", "Пакеты для отходов", "Разрешены игрушки для собак",
  "Освещение ночью", "Шланг", "Законодательство по породам", "Набор для безопасного снятия ошейника"
];



export const petUriImage = 'https://firebasestorage.googleapis.com/v0/b/petmeetar.appspot.com/o/assets%2Fimages%2Fpet%2Fthumbnail.png?alt=media&token=f6fd6149-8755-4a80-a903-635de3c570eb';